ScApplication/src/jbiasa/ScApplication.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="ScApplication"
             xmlns:tns="ScApplication" xmlns:ns="http://j2ee.netbeans.org/wsdl/ScBEPEL/src/product" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/ScBEPEL/src/product" location="../jbiServiceUnits/ScBEPEL/product.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:productPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="productOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="ScApplication"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="ScApplication"/>
            </output>
        </operation>
    </binding>
    <service name="ScApplicationService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/ScApplicationService1/casaPort1"/>
        </port>
    </service>
</definitions>
