ScApplication/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:scap="ScApplication">
  <soapenv:Body>
    <scap:productOperation>
      <productType>TV</productType>
      <quantity>129</quantity>
    </scap:productOperation>
  </soapenv:Body>
</soapenv:Envelope>